# DBeam_SetShowAtPoint

```pascal
PROCEDURE DBeam_SetShowAtPoint(showFlag : INTEGER);
```

```python
def vs.DBeam_SetShowAtPoint(showFlag):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|showFlag|INTEGER|   |

## Examples
```pascal
DBeam_SetShowAtPoint(1);
```
```python
import vs

showFlag = 1

vs.DBeam_SetShowAtPoint(showFlag)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight